lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/video/camera/device/ov7670/fsl_ov7670.c
    u16Temp = startPoint->vstartCoordinate + FSL_VIDEO_EXTRACT_HEIGHT(resolution);
    u16Vref = (u16Temp & 0x03U);
    u16Vref = u16Vref << 2;
    u16Vref |= (startPoint->vstartCoordinate & 0x03U);
    u16Vref &= 0xF0U;
    (void)OV7670_ModifyReg(handle, OV7670_VREF_REG, 0xc0, (uint8_t)u16Vref);
    u16Temp = u16Temp >> 2;
    (void)OV7670_WriteReg(handle, OV7670_VSTOP_REG, (uint8_t)u16Temp);
    u16Temp = ((startPoint->vstartCoordinate & 0x3fcU) >> 2);
    (void)OV7670_WriteReg(handle, OV7670_VSTART_REG, (uint8_t)u16Temp);

    return kStatus_Success;
}

status_t OV7670_GammaCurveSlope(camera_device_handle_t *handle,
                                const ov7670_gamma_curve_slope_config_t *gammaCurveSlopeConfig)
{
    (void)OV7670_WriteReg(handle, OV7670_SLOP_REG, gammaCurveSlopeConfig->slope);
    (void)OV7670_WriteReg(handle, OV7670_GAM1_REG, gammaCurveSlopeConfig->gam1);
    (void)OV7670_WriteReg(handle, OV7670_GAM2_REG, gammaCurveSlopeConfig->gam2);
    (void)OV7670_WriteReg(handle, OV7670_GAM3_REG, gammaCurveSlopeConfig->gam3);
    (void)OV7670_WriteReg(handle, OV7670_GAM4_REG, gammaCurveSlopeConfig->gam4);
    (void)OV7670_WriteReg(handle, OV7670_GAM5_REG, gammaCurveSlopeConfig->gam5);
    (void)OV7670_WriteReg(handle, OV7670_GAM6_REG, gammaCurveSlopeConfig->gam6);
    (void)OV7670_WriteReg(handle, OV7670_GAM7_REG, gammaCurveSlopeConfig->gam7);
    (void)OV7670_WriteReg(handle, OV7670_GAM8_REG, gammaCurveSlopeConfig->gam8);
    (void)OV7670_WriteReg(handle, OV7670_GAM9_REG, gammaCurveSlopeConfig->gam9);
    (void)OV7670_WriteReg(handle, OV7670_GAM10_REG, gammaCurveSlopeConfig->gam10);
    (void)OV7670_WriteReg(handle, OV7670_GAM11_REG, gammaCurveSlopeConfig->gam11);
    (void)OV7670_WriteReg(handle, OV7670_GAM12_REG, gammaCurveSlopeConfig->gam12);
    (void)OV7670_WriteReg(handle, OV7670_GAM13_REG, gammaCurveSlopeConfig->gam13);
    (void)OV7670_WriteReg(handle, OV7670_GAM14_REG, gammaCurveSlopeConfig->gam14);
    (void)OV7670_WriteReg(handle, OV7670_GAM15_REG, gammaCurveSlopeConfig->gam15);

    return kStatus_Success;
}

void OV7670_GetDefaultConfig(ov7670_config_t *config)
{
    config->outputFormat   = (ov7670_output_format_config_t *)&OV7670_FORMAT_RGB565;
    config->resolution     = (uint32_t)kVIDEO_ResolutionQQVGA;
    config->frameRate      = (ov7670_frame_rate_config_t *)&OV7670_25FPS_12MHZ_XCLK;
    config->contrast       = 0x30;
    config->brightness     = 0x10;
    config->advancedConfig = NULL;
}

status_t OV7670_Init(camera_device_handle_t *handle, const camera_config_t *config)
{
    status_t status;
    ov7670_resource_t *resource = (ov7670_resource_t *)(handle->resource);
    ov7670_config_t cameraConfig;

    if ((kVIDEO_PixelFormatYUYV != config->pixelFormat) && (kVIDEO_PixelFormatRGB565 != config->pixelFormat) &&
        (kVIDEO_PixelFormatRGBX4444 != config->pixelFormat) && (kVIDEO_PixelFormatXRGB4444 != config->pixelFormat) &&
        (kVIDEO_PixelFormatXRGB1555 != config->pixelFormat))
    {
        return kStatus_InvalidArgument;
    }

    if ((15U != config->framePerSec) && (30U != config->framePerSec) && (25U != config->framePerSec) &&
        (14U != config->framePerSec))
    {
        return kStatus_InvalidArgument;
    }

    if ((kCAMERA_InterfaceNonGatedClock != config->interface) && (kCAMERA_InterfaceGatedClock != config->interface))
    {
        return kStatus_InvalidArgument;
    }

    OV7670_GetDefaultConfig(&cameraConfig);
    cameraConfig.resolution = config->resolution;
    switch (resource->xclock)
    {
        case kOV7670_InputClock24MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_24MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_24MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_24MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_24MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        case kOV7670_InputClock12MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_12MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_12MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_12MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_12MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        case kOV7670_InputClock26MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_26MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_26MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_26MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_26MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        case kOV7670_InputClock13MHZ:
            if (config->framePerSec == 30U)
            {
                cameraConfig.frameRate = &OV7670_30FPS_13MHZ_XCLK;
            }
            else if (config->framePerSec == 25U)
            {
                cameraConfig.frameRate = &OV7670_25FPS_13MHZ_XCLK;
            }
            else if (config->framePerSec == 15U)
            {
                cameraConfig.frameRate = &OV7670_15FPS_13MHZ_XCLK;
            }
            else if (config->framePerSec == 14U)
            {
                cameraConfig.frameRate = &OV7670_14FPS_13MHZ_XCLK;
            }
            else
            {
                assert(false);
            }
            break;
        default:
            assert(false);
            break;
    }

    switch (config->pixelFormat)
    {
        case kVIDEO_PixelFormatYUYV:
            cameraConfig.outputFormat = &OV7670_FORMAT_YUV422;
            break;

        case kVIDEO_PixelFormatXRGB1555:
            cameraConfig.outputFormat = &OV7670_FORMAT_RGB555;
            break;

        case kVIDEO_PixelFormatRGBX4444:
            cameraConfig.outputFormat = &OV7670_FORMAT_RGBx444;
            break;

        case kVIDEO_PixelFormatXRGB4444:
            cameraConfig.outputFormat = &OV7670_FORMAT_xRGB444;
            break;

        case kVIDEO_PixelFormatRGB565:
        default:
            cameraConfig.outputFormat = &OV7670_FORMAT_RGB565;
            break;
    }

    do
    {
        status = OV7670_CameraInit(handle, &cameraConfig);
    } while (status != kStatus_Success);

    return status;
}

status_t OV7670_Deinit(camera_device_handle_t *handle)
{
    return kStatus_Success;
}

status_t OV7670_Start(camera_device_handle_t *handle)
{
    return kStatus_Success;
}

status_t OV7670_Stop(camera_device_handle_t *handle)
{
    return kStatus_Success;
}

status_t OV7670_InitExt(camera_device_handle_t *handle, const camera_config_t *config, const void *specialConfig)
{
    return OV7670_Init(handle, config);
}

status_t OV7670_Control(camera_device_handle_t *handle, camera_device_cmd_t cmd, int32_t arg)
{
    return kStatus_InvalidArgument;
}
